app/Controllers/Admin.php

INSERT INTO `products` (`product_name`, `product_brand`, `product_model`, `product_type`, `product_cooling_capacity`, `product_power_consumption`, `product_price`, `product_stock_quantity`, `product_description`, `product_created_at`, `product_updated_at`) VALUES ('dsggsdfg', 'sdfgsdfg', 'dsfgsdf', 'gsdfgs', '34232', '34', '2342', '324', 'dfgsdfgsdfg', '2023-07-08 01:28:09', '2023-07-08 01:28:09')
---
    public function createProduct()
    {
        $data = [
            'title' => 'Add new Product',
            'active' => 'product'
        ];
        if (session()->get('loggedin') == false) {
            return redirect()->to('Auth/login');
        } else {
            if ($this->request->getMethod() == 'post') {
                $model = new ProductModel();
                $model2 = new ProductImageModel();
                $data1 = array(
                    'product_name' => $this->request->getVar('product_name'),
                    'product_brand' => $this->request->getVar('product_brand'),
                    'product_model' => $this->request->getVar('product_model'),
                    'product_type' => $this->request->getVar('product_type'),
                    'product_cooling_capacity' => $this->request->getVar('product_cooling_capacity'),
                    'product_power_consumption' => $this->request->getVar('product_power_consumption'),
                    'product_price' => $this->request->getVar('product_price'),
                    'product_stock_quantity' => $this->request->getVar('product_stock_quantity'),
                    'product_description' => $this->request->getVar('product_description')
                );
                $model->insert($data1);