app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = \Config\Services::session();
        $sysset = new SystemSettingsModel();
        session()->set($sysset->find(1));
        // session()->set(['popup' => false]);
        $likemodel = new LikeItemModel();
        $likenum = $likemodel->where('client_id', session('client_id'))->countAllResults();
---
SELECT *
FROM `system_settings`
WHERE `system_settings`.`ss_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `like_item`
WHERE `client_id` = '4'