app/Controllers/Client.php

    public function index()
    {
       if(session()->get('client_loggedin') == false){
            session()->set(['popup' => false]);
       }
       $data = [
        'title' => 'Product List',
        'active' => 'product'
        ];
        $data1 = [];
        $model = new ProductModel();
        $model2 = new ProductImageModel();
        $products = $model->findAll();
        foreach ($products as $product) {
            $productimages = $model2->where('product_id', $product['product_id'])->findAll();
---
SELECT *
FROM `products`
SELECT *
FROM `product_image`
WHERE `product_id` = '53'

    public function view_likes($client_id){
        $data = [
            'title' => 'Liked Items',
            'active' => 'product'
            ];
        $model = new LikeItemModel();
        $model2 = new ProductImageModel();
        // $data['likes']
        $products = $model->where('client_id', $client_id)->join('products','products.product_id = like_item.product_id', 'inner' )->findAll();
        foreach ($products as $product) {
            $productimages = $model2->where('product_id', $product['product_id'])->findAll();
---
SELECT *
FROM `like_item`
INNER JOIN `products` ON `products`.`product_id` = `like_item`.`product_id`
WHERE `client_id` = '4'
SELECT *
FROM `product_image`
WHERE `product_id` = '50'

    public function view_item($product_id){
        $data = [
            'title' => 'View Item',
            'active' => 'product'
            ];
        $model = new ProductModel();
        $model1 = new ProductImageModel();
        $data['item'] = $model->find($product_id);
        $data['product_images'] = $model1->where('product_id', $product_id)->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '51'
SELECT *
FROM `product_image`
WHERE `product_id` = '51'

    public function like_item($prod_id, $client_id){
        $model = new LikeItemModel();
        $data = array(
            'client_id' => $client_id,
            'product_id' => $prod_id
        );

        if($model->where($data)->countAllResults() > 0){
            session()->setFlashdata(['alert' => 'Item already in your likes']);
            return redirect()->to('Client/view_item/'. $prod_id);
        }else{
            $model->insert($data);
---
INSERT INTO `like_item` (`client_id`, `product_id`, `li_created_at`, `li_updated_at`) VALUES ('4', '53', '2023-07-08 01:28:33', '2023-07-08 01:28:33')

    public function searchItem(){
        $data = [
            'title' => 'Searched Item',
            'active' => 'product'
            ];
        if($this->request->getMethod() == 'post'){
            $model = new ProductModel();
            $model2 = new ProductImageModel();
            $products = $model->like($this->request->getVar('search_category'), $this->request->getVar('search'))->findAll();
            foreach ($products as $product) {
                $productimages = $model2->where('product_id', $product['product_id'])->findAll();
---
SELECT *
FROM `product_image`
WHERE `product_id` = '50'

    public function chat($client_id){
        $model = new ChatModel();
        $data = [
            'title' => 'Chat',
            'active' => 'product'
        ];
        if($this->request->getMethod() == 'post'){
            $message = $this->request->getVar('message');
            $client_id = $this->request->getVar('client_id');
            $data1 = [
                'chat_sender' => $client_id,
                'chat_receiver' => 'admin',
                'chat_message' => $message
            ];

            $model->insert($data1);
            return redirect()->to('Client/chat/'. $client_id);
        }


        $chat1 = $client_id;
        $data['chats'] = $model->where("chat_sender='admin' AND chat_receiver={$chat1} OR chat_sender={$chat1} AND chat_receiver='admin'")->limit(3)->orderBy('chat_created_at', 'ASC')->findAll();
---
SELECT *
FROM `chats`
WHERE `chat_sender` = 'admin' AND `chat_receiver` = 4 OR `chat_sender` = 4 AND `chat_receiver` = 'admin'
ORDER BY `chat_created_at` ASC